ticketsale/app/controllers/orders_controller.rb

INSERT INTO "orders" ("amount", "user_id", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?)  [["amount", 100], ["user_id", 1], ["created_at", "2019-03-27 17:20:44.686838"], ["updated_at", "2019-03-27 17:20:44.686838"], ["date", "2019-03-20 17:20:00"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "date" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["date", "2019-03-27 17:02:00"], ["updated_at", "2019-03-27 17:02:05.369859"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)