ticketsale/app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("price", "event_id", "category_id", "user_id", "created_at", "updated_at", "order_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["price", 100], ["event_id", 1], ["category_id", 1], ["user_id", 1], ["created_at", "2019-03-27 17:21:10.939409"], ["updated_at", "2019-03-27 17:21:10.939409"], ["order_id", 2]]

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "order_id" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["order_id", 1], ["updated_at", "2019-03-27 16:41:15.378347"], ["id", 1]]